In [34]:
import pandas as pd
import numpy as np
import os
import ast

In [39]:
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, np.nan],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
df[['Name', 'Age', 'Address', 'Qualification']]

     Name   Age    Address Qualification
0     Jai  27.0      Delhi           Msc
1  Princi  24.0     Kanpur            MA
2  Gaurav  22.0  Allahabad           MCA
3    Anuj   NaN    Kannauj           Phd

In [45]:
# All the arrays in the dictionary should have the same length.
# If they are not, use these to fill up with none values.
df1 = pd.DataFrame.from_dict(data1, orient='index')
df1.transpose()

     Name   Age    Address Qualification
0     Jai    27      Delhi           Msc
1  Princi    24     Kanpur            MA
2  Gaurav  None  Allahabad           MCA
3    Anuj  None    Kannauj           Phd

In [48]:
# Save to csv
df.to_csv(os.getcwd()+"\\test.csv")

# Open from csv
df1 = pd.read_csv(os.getcwd()+"\\test.csv")

In [17]:
df1[['Name', 'Age', 'Address', 'Qualification']]

     Name   Age    Address Qualification
0     Jai  27.0      Delhi           Msc
1  Princi  24.0     Kanpur            MA
2  Gaurav  22.0  Allahabad           MCA
3    Anuj   NaN    Kannauj           Phd

In [5]:
df1['Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [6]:
df1['Name'].describe()

count          4
unique         4
top       Princi
freq           1
Name: Name, dtype: object

In [7]:
df1.iloc[1]

Unnamed: 0            1
Name             Princi
Age                  24
Address          Kanpur
Qualification        MA
Name: 1, dtype: object

In [21]:
df1.head(3)

   Unnamed: 0    Name   Age    Address Qualification
0           0     Jai  27.0      Delhi           Msc
1           1  Princi  24.0     Kanpur            MA
2           2  Gaurav  22.0  Allahabad           MCA

In [18]:
df1[['Name']]

     Name
0     Jai
1  Princi
2  Gaurav
3    Anuj

In [25]:
for i in df1['Age'].to_numpy():
    print(i)

27.0
24.0
22.0
nan

In [19]:
for i in df1.items():
    print(i)

('Unnamed: 0', 0    0
1    1
2    2
3    3
Name: Unnamed: 0, dtype: int64)
('Name', 0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object)
('Age', 0    27.0
1    24.0
2    22.0
3     NaN
Name: Age, dtype: float64)
('Address', 0        Delhi
1       Kanpur
2    Allahabad
3      Kannauj
Name: Address, dtype: object)
('Qualification', 0    Msc
1     MA
2    MCA
3    Phd
Name: Qualification, dtype: object)

In [14]:
# making data frame
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# calling head() method 
# storing in new variable
data_top = data.head(6)
  
# display
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0

In [18]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv", index_col ="Name")
data.loc["Avery Bradley"]          #find and display row for specific name

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [22]:
data.iloc[1]

Team        Boston Celtics
Number                99.0
Position                SF
Age                   25.0
Height                 6-6
Weight               235.0
College          Marquette
Salary           6796117.0
Name: Jae Crowder, dtype: object

In [15]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64